"name":"feedback",
"name":"Feedback comes in two flavours: positive feedback,
"name":"Positive feedback adds the feedback to the input,
"name":"negative feedback subtracts the feedback from the input makig the output smaller than the input",
"name":"In electronics,
"name":"Typically the input signal goes into the positive input and the feedback loop goes back to the negative input and makes the circuit self regulate",
"name":"Feedback doesn't work very well unless there's a little bit of time delay between output back to input",
"name":"this means that functional notation does not encourage thinking about feedback since in functional notation functions,
"name":"In essence,
"name":"If you feed all of the output straight to the negative input of an op amp,
"name":"A little bit smaller the feedback loop so that every time around the loop the feedback from the output gets a little bit smaller and smaller until there's nothing left",
"name":"There's a delay in the feedback loop (called \"propagation delay\"),
"name":"The shrinking effect is called \"ringing\",
"name":"I find it easiest to think about feedback in relation to audio",
"name":"Hendrix used +ve feedback,
"name":"Hendrix stood in front of his amp,
"name":"resonation only works if the notes (frequencies) are the same",
"name":"if you change the frequency of the notes,
"name":"Hendrix would change the frequencies of the notes by bending notes with his fretting hand or pressing/pulling the whammy bar on his guitar",
"name":"in a P.A. system,
"name":"the first line of defence in preventing feeback in a P.A. is to ensure that the microphone is behind the speakers",
"name":"Feedback might be less complicated in the digital realm (instead of the analog realm).  There's only 2 values - 0 or 1.",
"name":"+ve feedback: 1+1 = 2",
"name":"-ve feedback: 1-1 = 0",
"name":"1+(delayed)1 = ???",
"name":"1-(delayed)1 = ???",
"name":"Pulse Width Modulation (PWM)",
"name":"a series,
"name":"\"Backloop\",
"name":"Connection Type 1",
"name":"Tuesday Mar 23/21",
"name":"humdrum",
"name":"Paul",
